{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4900\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>wikidata_id</th>\n",
       "      <th>acmi_id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Q6255888</td>\n",
       "      <td>creators/21267</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Q63069</td>\n",
       "      <td>creators/32979</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Q2158449</td>\n",
       "      <td>creators/80769</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Q3195038</td>\n",
       "      <td>creators/15007</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Q3672555</td>\n",
       "      <td>creators/22745</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  wikidata_id         acmi_id\n",
       "0    Q6255888  creators/21267\n",
       "1      Q63069  creators/32979\n",
       "2    Q2158449  creators/80769\n",
       "3    Q3195038  creators/15007\n",
       "4    Q3672555  creators/22745"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# determine stats on how many linked creators can pull summaries or images, and for those what license.\n",
    "\n",
    "import numpy\n",
    "import pandas\n",
    "import pathlib\n",
    "import pydash\n",
    "import requests\n",
    "import time\n",
    "import tqdm\n",
    "\n",
    "def value_extract(row, column):\n",
    "\n",
    "    ''' Extract dictionary values. '''\n",
    "    \n",
    "    return pydash.get(row[column], 'value')\n",
    "\n",
    "def sparql_query(query, service):\n",
    "\n",
    "    ''' Send sparql request, and formulate results into a dataframe. '''\n",
    "\n",
    "    response = requests.get(service, params={'format': 'json', 'query': query}, timeout=120)\n",
    "    results = pydash.get(response.json(), 'results.bindings')\n",
    "    data_frame = pandas.DataFrame.from_dict(results)\n",
    "    for column in data_frame.columns:\n",
    "        data_frame[column] = data_frame.apply(value_extract, column=column, axis=1)\n",
    "    \n",
    "    return data_frame\n",
    "\n",
    "wikidata_query = ''' select ?wikidata_id ?acmi_id where { ?wikidata_id wdt:P7003 ?acmi_id } '''\n",
    "wikidata_creators = sparql_query(wikidata_query, 'https://query.wikidata.org/sparql')\n",
    "wikidata_creators = wikidata_creators.loc[wikidata_creators.acmi_id.str.contains('creator', na=False)]\n",
    "wikidata_creators['wikidata_id'] = wikidata_creators['wikidata_id'].str.split('/').str[-1]\n",
    "\n",
    "print(len(wikidata_creators))\n",
    "wikidata_creators.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 20/20 [03:35<00:00, 10.76s/it]"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1895 4880 0.39\n",
      "4\n",
      "pd --- 0.32\n",
      "cc-by-sa-3.0 --- 0.21\n",
      "cc-by-3.0 --- 0.06\n",
      "cc-by-sa-2.0 --- 0.1\n",
      "cc-by-2.0 --- 0.11\n",
      "cc-by-sa-4.0 --- 0.13\n",
      "cc-by-2.5 --- 0.01\n",
      "cc-by-sa-1.0 --- 0.0\n",
      "cc-by-4.0 --- 0.03\n",
      "cc0 --- 0.02\n",
      "cc-by-sa-3.0-de --- 0.0\n",
      "cc-by-sa-2.5 --- 0.01\n",
      "cc-by-3.0-us --- 0.0\n",
      "cc-by-sa-3.0-nl --- 0.01\n",
      "cc-by-sa-2.0-fr --- 0.0\n",
      "cc-by-2.5-dk --- 0.0\n",
      "cc-by-3.0-br --- 0.0\n",
      "cc-by-1.0 --- 0.0\n",
      "cc-by-sa-3.0-rs --- 0.0\n",
      "cc-by-sa-2.0-de --- 0.0\n",
      "cc-by-3.0-au --- 0.0\n",
      "cc-by-2.5-pl --- 0.0\n",
      "cc-by-3.0-de --- 0.0\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>wikidata_creator</th>\n",
       "      <th>image</th>\n",
       "      <th>imageLicense</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q72229</td>\n",
       "      <td>http://commons.wikimedia.org/wiki/Special:File...</td>\n",
       "      <td>pd</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.wikidata.org/entity/Q72291</td>\n",
       "      <td>http://commons.wikimedia.org/wiki/Special:File...</td>\n",
       "      <td>pd</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://www.wikidata.org/entity/Q72579</td>\n",
       "      <td>http://commons.wikimedia.org/wiki/Special:File...</td>\n",
       "      <td>pd</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.wikidata.org/entity/Q73089</td>\n",
       "      <td>http://commons.wikimedia.org/wiki/Special:File...</td>\n",
       "      <td>pd</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://www.wikidata.org/entity/Q73136</td>\n",
       "      <td>http://commons.wikimedia.org/wiki/Special:File...</td>\n",
       "      <td>pd</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                        wikidata_creator   \n",
       "0  http://www.wikidata.org/entity/Q72229  \\\n",
       "1  http://www.wikidata.org/entity/Q72291   \n",
       "2  http://www.wikidata.org/entity/Q72579   \n",
       "3  http://www.wikidata.org/entity/Q73089   \n",
       "4  http://www.wikidata.org/entity/Q73136   \n",
       "\n",
       "                                               image imageLicense  \n",
       "0  http://commons.wikimedia.org/wiki/Special:File...           pd  \n",
       "1  http://commons.wikimedia.org/wiki/Special:File...           pd  \n",
       "2  http://commons.wikimedia.org/wiki/Special:File...           pd  \n",
       "3  http://commons.wikimedia.org/wiki/Special:File...           pd  \n",
       "4  http://commons.wikimedia.org/wiki/Special:File...           pd  "
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "dataframe = pandas.DataFrame()\n",
    "\n",
    "for chunk in tqdm.tqdm(numpy.array_split(wikidata_creators.wikidata_id.unique(), 20)):\n",
    "\n",
    "    time.sleep(4)\n",
    "\n",
    "    chunk_creator = ' '.join(['wd:'+x for x in chunk])\n",
    "\n",
    "    query = '''\n",
    "        select ?wikidata_creator ?image ?imageLicense  \n",
    "        where {\n",
    "            values ?wikidata_creator {'''+chunk_creator+'''}\n",
    "            optional { ?wikidata_creator wdt:P18 ?image .\n",
    "                bind(strafter(wikibase:decodeUri(str(?image)), \"http://commons.wikimedia.org/wiki/Special:FilePath/\") AS ?fileTitle)\n",
    "                service wikibase:mwapi {\n",
    "                    bd:serviceParam wikibase:endpoint \"commons.wikimedia.org\";\n",
    "                    wikibase:api \"Generator\";\n",
    "                    wikibase:limit \"once\";\n",
    "                    mwapi:generator \"allpages\";\n",
    "                    mwapi:gapfrom ?fileTitle;\n",
    "                    mwapi:gapnamespace 6; # NS_FILE\n",
    "                    mwapi:gaplimit 1;\n",
    "                    mwapi:prop \"imageinfo\";\n",
    "                    mwapi:iiprop \"extmetadata\" .\n",
    "                    ?imageLicense wikibase:apiOutput \"imageinfo/ii/extmetadata/License/@value\".\n",
    "                }\n",
    "            }\n",
    "        } '''\n",
    "    \n",
    "    dataframe = pandas.concat([dataframe, sparql_query(query, 'https://query.wikidata.org/sparql')])\n",
    "\n",
    "image_available = len(dataframe.loc[dataframe.image.str.contains('wiki', na=False)])\n",
    "print(image_available, len(dataframe), round(image_available/len(dataframe), 2))\n",
    "\n",
    "dataframe = dataframe.dropna()\n",
    "print(len('----'))\n",
    "for x in dataframe.imageLicense.unique():\n",
    "    section = dataframe.loc[dataframe.imageLicense.isin([x])]\n",
    "    print(x, '---', round(len(section)/len(dataframe), 2))\n",
    "\n",
    "dataframe.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 20/20 [01:53<00:00,  5.67s/it]"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3912 4821 0.81\n",
      "4821\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>wikidata_creator</th>\n",
       "      <th>article</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q73089</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Gene_Kelly</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.wikidata.org/entity/Q2001</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Stanley_Kubrick</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://www.wikidata.org/entity/Q72229</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Edward_Dmytryk</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.wikidata.org/entity/Q72291</td>\n",
       "      <td>https://en.wikipedia.org/wiki/David_O._Selznick</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://www.wikidata.org/entity/Q72579</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Samuel_Goldwyn</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                        wikidata_creator   \n",
       "0  http://www.wikidata.org/entity/Q73089  \\\n",
       "1   http://www.wikidata.org/entity/Q2001   \n",
       "2  http://www.wikidata.org/entity/Q72229   \n",
       "3  http://www.wikidata.org/entity/Q72291   \n",
       "4  http://www.wikidata.org/entity/Q72579   \n",
       "\n",
       "                                           article  \n",
       "0         https://en.wikipedia.org/wiki/Gene_Kelly  \n",
       "1    https://en.wikipedia.org/wiki/Stanley_Kubrick  \n",
       "2     https://en.wikipedia.org/wiki/Edward_Dmytryk  \n",
       "3  https://en.wikipedia.org/wiki/David_O._Selznick  \n",
       "4     https://en.wikipedia.org/wiki/Samuel_Goldwyn  "
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# find wikipedia links per linked creator.\n",
    "\n",
    "dataframe = pandas.DataFrame()\n",
    "for chunk in tqdm.tqdm(numpy.array_split(wikidata_creators.wikidata_id.unique(), 20)):\n",
    "    time.sleep(4)\n",
    "    chunk_creator = ' '.join(['wd:'+x for x in chunk])\n",
    "    query = '''\n",
    "        select ?wikidata_creator ?article   \n",
    "        where {\n",
    "            values ?wikidata_creator {'''+chunk_creator+'''}\n",
    "                optional { ?article schema:about ?wikidata_creator .\n",
    "            ?article schema:isPartOf <https://en.wikipedia.org/> } .\n",
    "\n",
    "        } '''\n",
    "    dataframe = pandas.concat([dataframe, sparql_query(query, 'https://query.wikidata.org/sparql')])\n",
    "\n",
    "wiki_available = len(dataframe.loc[dataframe.article.str.contains('wiki', na=False)])\n",
    "print(wiki_available, len(dataframe), round(wiki_available/len(dataframe), 2))\n",
    "\n",
    "print(len(dataframe))\n",
    "dataframe.head()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.6"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
